#include <Arduino.h>
#include <SPI.h>
#include <WiFi.h>
#include <Ethernet2.h>
#include <nanomodbus.h>
#include <Bounce2.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <esp_task_wdt.h>
#include <Preferences.h>
#include <nvs_flash.h>
#include <Nextion.h>
#include <time.h>
#include <TimeLib.h>

uint8_t idFlow = 1; IPAddress ip(192, 168, 1, 124);
IPAddress gateway(192, 168, 1, 1), dns_server(192, 168, 110, 201), subnet(255,255,255,0);

const int X[8] = {26, 25, 33, 32, 35, 34, 39, 36}, Y[6] = {14, 13, 15, 2, 4, 0};
volatile int count[2], pulse[2];
volatile bool flagTime[2];
unsigned long prevMillis[2];
union mbFloatInt {
  struct {
    float kFact; //0, 1
    float capacity; //2, 3
    float setPoint; //4, 5
    float factorKurang; // 6, 7
    float liter; //8, 9
    float Flowrate; //10, 11
    uint16_t timeInterval_OnValve; //12
    uint16_t timeInterval_OffValve; //13
    uint16_t over_fl_err; //14
  } values;
  uint16_t words[16];
};
mbFloatInt mbFloat[2];
union mb_Int_Date_Time {
  struct {
    uint16_t day; //15
    uint16_t month; //16
    uint16_t year; //17
    uint16_t hour; //18
    uint16_t minute; //19
    uint16_t second; //20
  } values;
  uint16_t words[7];
};
mb_Int_Date_Time mb_int_date_time;
/* OnOffFlow, FlagLog, flagOn, flagOff, flagEventOnOff, flagOffPrev, flagPrintserial */
bool flagCoil[2][7], mb_flagCoil[29], IsConnectTCP, IsConnectTCP_Prev;
bool flag_prev_log[2];
bool mode_produksi_persiapan[2];
uint8_t mb_sizeHoldingRegister = (sizeof(mbFloat[0].words) / sizeof(mbFloat[0].words[0]) * 2) + sizeof(mb_int_date_time.words) / sizeof(mb_int_date_time.words[0]), mb_sizeCoil = 10 + (sizeof(mb_flagCoil) / sizeof(mb_flagCoil[0]));
unsigned long timePrevOn[2], timePrevOff[2], timePrevIsConnectTCP;
//Variable NEXTION
const char *tanki_1_char[5] = {"Tanki T1" , "Tanki T2", "Tanki T3", "Tanki T4", "Tanki T5"};
const char *tanki_2_char[4] = {"Tanki A1" , "Tanki A2", "Tanki B1", "Tanki B2"};
const char *batch_char[10] = {"Batch 01", "Batch 02", "Batch 03", "Batch 04", "Batch 05", "Batch 06", "Batch 07", "Batch 08", "Batch 09", "Batch 10"};
